kossnikita/at32f4xx-pac/src/at32f403/at32f403.svd
        <register>
          <name>BK1TMGWR1</name>
          <displayName>BK1TMGWR1</displayName>
          <description>SRAM/NOR-Flash write timing registers
          1</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ASYNCM</name>
              <description>Asynchronous mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BUSLAT</name>
              <description>Bus latency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DTST</name>
              <description>Asynchronous data setup time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ADDRHT</name>
              <description>Address-hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRST</name>
              <description>Address setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BK1TMGWR2</name>
          <displayName>BK1TMGWR2</displayName>
          <description>SRAM/NOR-Flash write timing registers
          2</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ASYNCM</name>
              <description>Asynchronous mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BUSLAT</name>
              <description>Bus latency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DTST</name>
              <description>Asynchronous data setup time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ADDRHT</name>
              <description>Address-hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRST</name>
              <description>Address setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BK1TMGWR3</name>
          <displayName>BK1TMGWR3</displayName>
          <description>SRAM/NOR-Flash write timing registers
          3</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ASYNCM</name>
              <description>Asynchronous mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BUSLAT</name>
              <description>Bus latency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DTST</name>
              <description>Asynchronous data setup time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ADDRHT</name>
              <description>Address-hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRST</name>
              <description>Address setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BK1TMGWR4</name>
          <displayName>BK1TMGWR4</displayName>
          <description>SRAM/NOR-Flash write timing registers
          4</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ASYNCM</name>
              <description>Asynchronous mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BUSLAT</name>
              <description>Bus latency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DTST</name>
              <description>Asynchronous data setup time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ADDRHT</name>
              <description>Address-hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRST</name>
              <description>Address setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT1</name>
          <displayName>EXT1</displayName>
          <description>externl timeing register 1</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000808</resetValue>
          <fields>
            <field>
              <name>BUSLATW2W</name>
              <description>Bus turnaround phase for consecutive write duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSLATR2R</name>
              <description>Bus turnaround phase for consecutive read duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT2</name>
          <displayName>EXT2</displayName>
          <description>externl timeing register 2</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000808</resetValue>
          <fields>
            <field>
              <name>BUSLATW2W</name>
              <description>Bus turnaround phase for consecutive write duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSLATR2R</name>
              <description>Bus turnaround phase for consecutive read duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT3</name>
          <displayName>EXT3</displayName>
          <description>externl timeing register 3</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000808</resetValue>
          <fields>
            <field>
              <name>BUSLATW2W</name>
              <description>Bus turnaround phase for consecutive write duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSLATR2R</name>
              <description>Bus turnaround phase for consecutive read duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT4</name>
          <displayName>EXT4</displayName>
          <description>externl timeing register 4</description>
          <addressOffset>0x22C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000808</resetValue>
          <fields>
            <field>
              <name>BUSLATW2W</name>
              <description>BUSLATW2W</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSLATR2R</name>
              <description>BUSLATR2R</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
