kossnikita/at32f4xx-pac/src/at32f403/at32f403.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <description>Watchdog</description>
      <groupName>WDT</groupName>
      <baseAddress>0x40003000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CMD</name>
          <displayName>CMD</displayName>
          <description>Command register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <description>Command register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                <name>CMD</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Unlock</name>
                  <description>Unlock write-protected WDT_DIV and WDT_RLD</description>
                  <value>21845</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reload</name>
                  <description>Reload counter</description>
                  <value>43690</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable WDT. If the hardware watchdog has been enabled, ignore this operation.</description>
                  <value>52428</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIV</name>
          <displayName>DIV</displayName>
          <description>Division register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIV</name>
              <description>Division divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>DIV</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>div4</name>
                  <description>LICK divided by 4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div8</name>
                  <description>LICK divided by 8</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div16</name>
                  <description>LICK divided by 16</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div32</name>
                  <description>LICK divided by 32</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div64</name>
                  <description>LICK divided by 64</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div128</name>
                  <description>LICK divided by 128</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div256</name>
                  <description>LICK divided by 256</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div256_2</name>
                  <description>LICK divided by 256</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RLD</name>
          <displayName>RLD</displayName>
          <description>Reload register</description>
          <addressOffset>0x8</addressOffset>
          <size>0xc</size>
          <access>read-write</access>
          <resetValue>0x00000FFF</resetValue>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>4095</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>STS</name>
          <displayName>STS</displayName>
          <description>Status register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIVF</name>
              <description>Division value update complete flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DIVF</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Complete</name>
                  <description>Division value update complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InProgress</name>
                  <description>Division value update is in process</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RLDF</name>
              <description>Reload value update complete flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RLDF</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Complete</name>
                  <description>Reload value update complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>InProgress</name>
                  <description>Reload value update is in process</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
